theTower_stats_app.org
* Stats Tracking App for The Tower Mobile Game 
** Goals/Intent
- Import data via raw text paste from The Tower either after a round or from 'Battle History'
  - Will check to dedupe imports 
  - Can delete saved runs 
- Stats are then tracked and charted over time via Analysis Engine
  - Computed Rates per Round over time
  - Deltas between Rounds
- Values are parsed from Raw Values stored in the DB and normalized/derived never destroyed
- Responsive Layout/UI
  - Battle Results form is designed for mobile
** Requirements
python
django
Chart.js
Foundation
Sass
sqlite
pytest
pytest-django
ruff
mypy
** Overall Architecture
Raw Game Data
   ↓ (parser)
Normalized Units
   ↓
Analysis Engine  ←──── Player Context
   ↓
Derived Metrics
   ↓
Charts / Views
** Features
- Import Data :: Page to drop in Round Results. 
- Charts :: Overview of Progress over time
- Card Library :: log and show card collection progress. Based on the work done here, https://docs.google.com/spreadsheets/d/1vmIA7SMLtjAY8OooS8JC8hod0Lgvr5WsXB5vIStBJJg/edit?usp=sharing
  - Card Preset Tagging
    Tag Cards into groupings and then filter display by groupings. Each card can be a part of multiple presets
  - Widget to show Card Slots unlocked with button to unlock next slot and label to show cost
    Maximum allowed for each preset
- Wiki Scraper :: Pull Data from the Fandom Wiki via Management Command
  Manual Buttons to check for update and fetch updates.
  Cite source
  Name property links to wiki page as well
  
  - Pull tables
  - Extract rows and columns
  - Normalize text (%, seconds, multipliers)


  Targets:
  - Bots Upgrades
  - Cards
  - Guardian Chips
  - UW Upgrade Table
** Core Responsibilities
*** Rate Calculations

- Derived per run and over time:
- Coins / hour
- Coins / wave
- Damage / wave
- Waves / real minute
- Resource gains per hour (cells, shards, etc.)

These back Phase 1 charts directly.

*** Delta Calculations

Between two runs or windows:
- Absolute delta
- Percentage delta
- Rolling averages

Examples:
- Coins/hour before vs after unlocking a slot
- Damage output change after a UW unlock

No interpretation — just math.

*** Parameterized Effects

Using wiki-derived tables:
- Effective cooldown at star level
- % reduction or multiplier applied
- EV calculations (e.g. wave skip)

These are:
- Deterministic
- Re-computable across revisions
- Fully testable with golden tests

*** Aggregations by Intent (Presets)

- Presets act as labels, not logic.
- Only One Preset can be active at a time
- The engine supports:
  - “Aggregate metrics for runs where preset X was active”
  - “Compare metrics across presets”

It does not decide which preset is better.

*** Analysis Engine Invocation

- Stateless
- Accepts:
  - Query params (date range, tier, context)
  - Returns DTOs only
  - No DB writes

*** Output Shape

All outputs should conform to a small set of DTO-style objects:

#+BEGIN_SRC python
DerivedMetric(
    key="coins_per_hour",
    value=Decimal,
    unit="coins/hour",
    run_id=UUID,
    context={...}
)

MetricSeries(
    key="coins_per_hour",
    points=[(timestamp, value), ...],
    context={tier, preset, uw, guardian}
)
#+END_SRC

This maps cleanly to Chart.js datasets.

*** Module Structure (Suggested)
analysis/
├── engine.py          # orchestration
├── rates.py           # per-hour, per-wave math
├── deltas.py          # comparisons
├── effects.py         # wiki-parameter-based calculations
├── aggregations.py    # preset / context grouping
├── dto.py             # output shapes
├── tests/
│   ├── test_rates.py
│   ├── test_effects.py
│   └── fixtures/

** UX Design

- Dark Mode Default
- Top Dynamic Nav
  - Docs / Admin links to the right
  - Global Search Box
- Maxed Out/Completed Upgrades are highlighted with a Gold Box outline
** Example Stat Data
Can be exported at the end of a round or retrieved from 'Battle History' 

#+BEGIN_SRC 
Battle Report
Battle Date	Dec 07, 2025 21:59
Game Time	10h 24m 52s
Real Time	2h 17m 23s
Tier	7
Wave	1301
Killed By	Boss
Coins earned	17.55M
Coins per hour	7.67M
Cash earned	$55.90M
Interest earned	$2.13M
Gem Blocks Tapped	3
Cells Earned	346
Reroll Shards Earned	373
Combat
Damage dealt	111.78q
Damage Taken	19.19B
Damage Taken Wall	3.39B
Damage Taken While Berserked	0
Damage Gain From Berserk	x0.00
Death Defy	1
Lifesteal	1.44M
Projectiles Damage	9.66q
Projectiles Count	450.74K
Thorn damage	433.07T
Orb Damage	11.35q
Enemies Hit by Orbs	2.84K
Land Mine Damage	3.40q
Land Mines Spawned	21340
Rend Armor Damage	0
Death Ray Damage	0
Smart Missile Damage	0
Inner Land Mine Damage	0
Chain Lightning Damage	81.18q
Death Wave Damage	8.72T
Tagged by Deathwave	6523
Swamp Damage	5.47q
Black Hole Damage	0
Electrons Damage	0
Utility
Waves Skipped	229
Recovery Packages	320
Free Attack Upgrade	687
Free Defense Upgrade	638
Free Utility Upgrade	653
HP From Death Wave	0.00
Coins From Death Wave	136.82K
Cash From Golden Tower	$18.91M
Coins From Golden Tower	2.18M
Coins From Black Hole	0
Coins From Spotlight	50.55K
Coins From Orb	0
Coins from Coin Upgrade	5.71M
Coins from Coin Bonuses	9.20M
Enemies Destroyed
Total Enemies	76623
Basic	46959
Fast	10196
Tank	10620
Ranged	7745
Boss	106
Protector	144
Total Elites	75
Vampires	24
Rays	24
Scatters	27
Saboteur	0
Commander	0
Overcharge	0
Destroyed By Orbs	2842
Destroyed by Thorns	18
Destroyed by Death Ray	0
Destroyed by Land Mine	8135
Destroyed in Spotlight	9112
Bots
Flame Bot Damage	264.78T
Thunder Bot Stuns	1.00K
Golden Bot Coins Earned	17.41K
Destroyed in Golden Bot	629
Guardian
Damage	18.75T
Summoned enemies	0
Guardian coins stolen	0
Coins Fetched	17.73K
Gems	1
Medals	1
Reroll Shards	12
Cannon Shards	0
Armor Shards	0
Generator Shards	3
Core Shards	0
Common Modules	0
Rare Modules	0
#+END_SR

** Models
*** Game Data
This is a large blob of data shown to the player at the end of each round of the game. They will paste it into this app as plain text. Consider this a snapshot at import time.

Properties:
- RawText :: string (raw input from user)
- ParsedAt :: datestring of when it was created
- checksum :: for deduping imports

### Subordinate Classes:  
