theTower_stats_app.org
**** RunProgress
  - tier :: integer
  - battle date :: datestring
  - real time :: duration
  - wave :: integer
  - killed by :: string
**** RunEarnings
  - Coins earned :: 
  - Coins per hour ::
  - Cash earned ::
  - Interest earned ::
  - Gem Blocks Tapped ::
  - Cells Earned ::
  - Reroll Shards Earned ::
**** RunCombat
  - Damage dealt	111.78q
  - Damage Taken	19.19B
  - Damage Taken Wall	3.39B
  - Damage Taken While Berserked	0
  - Damage Gain From Berserk	x0.00
  - Death Defy	1
  - Lifesteal	1.44M
  - Projectiles Damage	9.66q
  - Projectiles Count	450.74K
  - Thorn damage	433.07T
  - Orb Damage	11.35q
  - Enemies Hit by Orbs	2.84K
  - Land Mine Damage	3.40q
  - Land Mines Spawned	21340
  - Rend Armor Damage	0
  - Death Ray Damage	0
  - Smart Missile Damage	0
  - Inner Land Mine Damage	0
  - Chain Lightning Damage	81.18q
  - Death Wave Damage	8.72T
  - Tagged by Deathwave	6523
  - Swamp Damage	5.47q
  - Black Hole Damage	0
  - Electrons DamageDamage dealt	111.78q
  - Damage Taken	19.19B
  - Damage Taken Wall	3.39B
  - Damage Taken While Berserked	0
  - Damage Gain From Berserk	x0.00
  - Death Defy	1
  - Lifesteal	1.44M
  - Projectiles Damage	9.66q
  - Projectiles Count	450.74K
  - Thorn damage	433.07T
  - Orb Damage	11.35q
  - Enemies Hit by Orbs	2.84K
  - Land Mine Damage	3.40q
  - Land Mines Spawned	21340
  - Rend Armor Damage	0
  - Death Ray Damage	0
  - Smart Missile Damage	0
  - Inner Land Mine Damage	0
  - Chain Lightning Damage	81.18q
  - Death Wave Damage	8.72T
  - Tagged by Deathwave	6523
  - Swamp Damage	5.47q
  - Black Hole Damage	0
  - Electrons Damage
**** RunUtility
Waves Skipped	229
Recovery Packages	320
Free Attack Upgrade	687
Free Defense Upgrade	638
Free Utility Upgrade	653
HP From Death Wave	0.00
Coins From Death Wave	136.82K
Cash From Golden Tower	$18.91M
Coins From Golden Tower	2.18M
Coins From Black Hole	0
Coins From Spotlight	50.55K
Coins From Orb	0
Coins from Coin Upgrade	5.71M
Coins from Coin Bonuses	9.20M
**** RunEnemies
Total Enemies	76623
Basic	46959
Fast	10196
Tank	10620
Ranged	7745
Boss	106
Protector	144
Total Elites	75
Vampires	24
Rays	24
Scatters	27
Saboteur	0
Commander	0
Overcharge	0
Destroyed By Orbs	2842
Destroyed by Thorns	18
Destroyed by Death Ray	0
Destroyed by Land Mine	8135
Destroyed in Spotlight	9112
**** RunBots
Flame Bot Damage	264.78T
Thunder Bot Stuns	1.00K
Golden Bot Coins Earned	17.41K
Destroyed in Golden Bot	629
**** RunGuardian
Damage	18.75T
Summoned enemies	0
Guardian coins stolen	0
Coins Fetched	17.73K
Gems	1
Medals	1
Reroll Shards	12
Cannon Shards	0
Armor Shards	0
Generator Shards	3
Core Shards	0
Common Modules	0
Rare Modules	0
*** BotsParameters
Wiki-derived, FK to PlayerBots
Immutable per revision. When the wiki changes, insert a new row — don’t overwrite.

*** CardDefinition

Properties:
- Name  :: string
- rarity :: string
- base_effect
- max_effect
- preset_tags (FK)

*** CardLevel / Star
- card (FK)
- stars :: integer
- value :: value of current effect (between base and max)

*** CardParameters
Wiki-derived, FK to PlayerCard
Immutable per revision. When the wiki changes, insert a new row — don’t overwrite.

*** CardSlots
tracker for Card Slots unlocked, maximum of 21
Modified via Admin

Properties:
- Slot Number (label)
- Cost integer (Gems)

*** GuardianChipParemeters
Wiki-derived, FK to PlayerGuardianChip
Immutable per revision. When the wiki changes, insert a new row — don’t overwrite.

*** PlayerBot

Properties:
- bot :: FK to BotParameters
- unlocked :: checkbox

*** PlayerCard

Properties:
- card_definition (FK)
- unlocked :: checkbox
- Stars :: integer 1-7 
- Cards :: integer progress toward next level. 0, 3, 5, 8, 12, 20, 32
*** PlayerGuardianChip

Properties:
- chip :: FK to GuardianChipParameters
- unlocked :: checkbox
*** PlayerUltimateWeapon

Properties:
- UW :: FK to UtimateWeaponParameters
- unlocked :: checkbox
*** PresetTags
- Name :: string
- Cards (FK)
- limit :: FK with Card Slots
*** UltimateWeaponParameters
Wiki-derived, FK to PlayerUtimateWeapon
Immutable per revision. When the wiki changes, insert a new row — don’t overwrite.

- Object for each UW (Spotlight, Golden Tower, Death Wave, Smart Missle, Chrono Field, Poison Swamp, Inner Land Mine, Black Hole
- Tracks 3 properties for each, stone cost and stones invested
- Will need CLI script to import from CSV data

Properties:
- UW Name :: string
- Property Name :: string
- Cost :: integer (stones)
- Spent :: integer (stones)
*** Unit Model
Percent and 'x' multipliers use semantic wrapper (Multiplier(1.15))

Properties:
- raw_value :: string
- normalized_value :: decimal
- magnitude :: (k,10^3),  (m, 10^6), (b, 10^9), (t, 10^12), etc.
- unit_type :: coins, damage, count, time
*** WikiData
Stores the anchor names and retrived data caches for Card, Ultimate Weapons, and Guardian Chips. Entities not seen in the most recent scrape are marked deprecated but retained.

- Page URL
- Cannonical Name
- EntityID
- content_hash
- source_section (table / row / column)
- first_seen
- last_seen
- parse_version
** Views 
*** Battle History
View previously entered stats 
*** Cards
Combine 'Cards,' 'CardLevel' and 'CardSlots'
*** Charts
Charts are configured via URL params initially; saved views are out of scope.

Pretty dashboard of metrics over time (filterable by date range and tier)
- Default View is by Event (start is 12/9/2025 00:00 UTC)
- Filter by Tier or all

Top Level Charts:
- Coins Earned (line)
- Coins per Hour (line)

Sub Charts:
- Cash Earned
- Cells Earned
- Reroll Dice Earned 
**** UW Performance
Breakdown and Comparison Views of RunCombat filtered to Given UW
**** Guardian Stats
Breakdown and comparison views of RunGuardian over time
**** Comparison Charts
Phase 2 Charts (Contextual Overlays)

- Same metric, different tiers
- With / without specific preset active
- Moving averages
**** Derived Metrics
- Effective cooldown reduction
- Coins per wave vs wave number
*** UW Progress
- Button to add new UW
*** Guardian Progress
- Button to add new chip
- checkbox to flag equiped 
*** Bots Progress
- button to add new bot
** Management Commands
*** fetch_wiki_data

args:
- cards
- bots
- ultimate_weapons
- guardian_chips
- all (grabs all of the above)
- --check :: dry-run to find deltas

Explicit idempotency guarantee

Logging output format (even briefly)
Example:
- “Logs entity added / changed / unchanged counts”
  
*** add_battle_report
Ingest and parse battle report data from the player. This is a large blob of data shown to the player at the end of each round of the game. They will paste it into this app as plain text.

Parser should gracefully alert the player to new labels that may appear after a game update.
