theTower_stats_app.org
**** DONE Documentation and Polish
CLOSED: [2025-12-17 Wed 16:01]
- State "DONE"       from "TODO"       [2025-12-17 Wed 16:01]
the tone and structure I'm  aiming for: professional, concise, technically accurate but still readable for non-technical users. 

- Consistent, hierarchical headings → perfect for generating a table of contents automatically in Google Docs.
- Clear sectioning by task flow (Overview → Setup → Operation → Advanced → Appendix).
- Step-by-step procedures with short bullet or numbered lists.
- Cautions and notes highlighted distinctly (we can use blockquotes and icons)
- Simple, non-code formatting — short, direct action verbs instead of command line snippets.

  

- [ ] Add Material Theme, mkdocstrings-python support
  Similar to mscrInventory's mkdocs.yml

  #+BEGIN_SRC yml
  
theme:
  name: material
  language: en
  palette:
    - scheme: default
      primary: indigo
      accent: blue
  features:
    - navigation.instant
    - navigation.sections
    - navigation.expand
    - navigation.path
    - navigation.top
    - search.suggest
    - search.highlight
    - search.share
    - toc.integrate
    - content.tabs.link
    - content.code.copy
  icon:
    repo: fontawesome/brands/github

markdown_extensions:
  - admonition
  - toc:
      permalink: true
  - footnotes
  - tables
  - fenced_code
  - codehilite:
      guess_lang: false
  - def_list
  - attr_list
  - md_in_html
  - admonition
  - pymdownx.details
  - pymdownx.extra
  - pymdownx.superfences
  - pymdownx.highlight
  - pymdownx.inlinehilite
  - pymdownx.snippets
  - pymdownx.magiclink
  - pymdownx.mark
  - pymdownx.keys
  - pymdownx.tasklist:
      custom_checkbox: true
  - pymdownx.emoji:
      emoji_generator: !!python/name:pymdownx.emoji.to_svg

  plugins:
  - search
  - mkdocstrings:
      handlers:
        python:
          paths: ["."]
          options:
            show_source: true
            docstring_style: google
            merge_init_into_class: true
  - autorefs
  #+END_SRC
- [ ] Move Phase 1, Phase 2, Phase 2.75, Phase 3, and Phase 4 under 'Development'
- [ ] Merge 'Management Command' section for 'fetch_wiki_data' with 'Wiki Population' page
- [ ] Add Docs for Each Dashboard
  - Callout Charts and Cards in index.md

- [ ] Add mkdocstrings pages for commands/API/etc.
**** DONE Need method for handling Player Bots/Cards/UW/Gaurdian Chips
CLOSED: [2025-12-17 Wed 16:01]
- State "DONE"       from "TODO"       [2025-12-17 Wed 16:01]
Hasn't been built out or thought out yet.
**** IN PROGRESS Cards [72%]
- State "IN PROGRESS" from "DONE"       [2025-12-17 Wed 16:45] \\
  scope creep!
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:58]
- Show a utility widget with 'CardSlots' Unlocked and a button to 'Unlock Next Slot'
- List all Cards in a Collapsible Table
  - Multiselect to add/create preset relationship to a card.
  - textbox to enter current inventory
  - Display 'CardLevel' and 'CardParameters'
  - Filter by Preset
***** DONE [#A] Inventory needs to track progress toward next level
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
Cards have 7 levels of boost and progress to the next level at 0, 3, 5, 8, 12, 20, and 32. So the 'inventory' field will be used to track progress to the next tier. If you have 4 stars for a card, inventory would reflect collected up to 12 (next threshold).

- **NEED** to decide how to roll over to higher tiers. If a player has 18/20 needed and collects 3 from the in game store. The new result would be 1/32.
- Highlight rows to denote rarity
- Highlight cards that are maxed out level 7 32/32 collected. 
***** DONE [#A] Parameter Column should be populated with card_definition.description
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
***** DONE [#A] Need a Filter Reset button for Presets
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
There should be an easier way that editing the Query String in the URL 
***** DONE [#B] Preset Membership should be styled as badges
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
https://get.foundation/sites/docs/badge.html

- Colored with at least 6 different colors. Can be assigned on creation. 
***** DONE [#C] Preset Tags Widget labels should be styled to match and be clickable links to apply the filter
CLOSED: [2025-12-17 Wed 14:11]

- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
***** DONE [#C] Remove Card Library Block
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "WAIT"       [2025-12-17 Wed 14:11]
- State "WAIT"       from "TODO"       [2025-12-16 Tue 17:38] \\
  haven't decided yet
It's big and not necessary. 

***** DONE [#B] Battle History <-> Preset Linking
CLOSED: [2025-12-17 Wed 14:11]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:11]
***** DONE Card Slots Widget should be functional
CLOSED: [2025-12-17 Wed 14:58]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:58]
Shows count of unlocked card slots and Gems cost of next slot
***** TODO Table Columns should be wortable
***** TODO Filter by Maxed/Unmaxed Cards
***** TODO Show Level Effect in Parameters
For 'Attack Speed':
Increase tower attack speed by x #

Should read:
Increase tower attack speed by x 2.15 (for level 7)
