theTower_stats_app.org
**** TODO [#C] Add Advice for Optimization
Based on logged performance data, it could be possible to calculate and offer suggestions based on the data.

For Example:
- Which UW to unlock next
- Bot properties to improve
- Guardian Chip properties to improve
- Weighted Preset Rankings
*** Phase 8 Multiple Player Support
**** TODO [#A] Wireup Github Actions to Run Tests
Run checks or Ruff Check, mypy ., pytest -q
**** TODO [#A] Allow Multiple Players to Store Data
***** Core Principle: Everything Belongs to a Player
**Analysis Engine is always player-scoped, even if there’s only one player.**
Every player-specific model must be bound to a Player.

Recommended structure:

#+BEGIN_SRC python
from django.contrib.auth.models import User

class Player(models.Model):
    user = models.OneToOneField(User, on_delete=models.CASCADE)
    display_name = models.CharField(max_length=64)
    created_at = models.DateTimeField(auto_now_add=True)
#+END_SRC

Then every mutable/progress model gets:
#+BEGIN_SRC python
player = models.ForeignKey(Player, on_delete=models.CASCADE)
#+END_SRC

This includes:
- player_cards
- player_relics
- player_labs
- battle_report
- run_history
- sim_results
- etc.

***** Authorization

Use groups + permissions, not custom flags.

Suggested groups
|Group |Purpose |
|---+---|
|admin | me |
|player| Default |

You can enforce almost everything via queryset filtering, not permissions alone.

***** Queryset Filtering Is the Real Security Layer

Permissions stop access.
Querysets prevent data leaks.

Pattern you’ll use everywhere

#+BEGIN_SRC python
def get_queryset(self):
    user = self.request.user
    if user.is_superuser:
        return Model.objects.all()
    return Model.objects.filter(player__user=user)
#+END_SRC

This applies to:
- Admin
- API views
- List views
- Export endpoints
- Sim endpoints

If you forget this once, players see each other’s data.

***** Django Admin: Lock It Down Properly
ModelAdmin example
#+BEGIN_SRC python
class PlayerCardAdmin(admin.ModelAdmin):
    def get_queryset(self, request):
        qs = super().get_queryset(request)
        if request.user.is_superuser:
            return qs
        return qs.filter(player__user=request.user)

    def save_model(self, request, obj, form, change):
        if not change:
            obj.player = request.user.player
        super().save_model(request, obj, form, change)
#+END_SRC

Also:

Remove player from editable fields for non-admins

Use readonly_fields where possible

***** API Layer (Even If You Don’t Build One Yet)

Design as if you will.

Never accept player_id from the client

Always derive it from request.user.

❌ Bad

{ "player_id": 12, "wave": 4500 }


✅ Good

player = request.user.player


This avoids spoofing and simplifies logic everywhere.

***** Shared vs Player-Scoped Models (Important Distinction)

You’ll have three categories of models:

A. Global Reference Data (NO player FK)

Cards

Relics

Labs

Enemies

Waves

Balance constants

These are read-only.

B. Player State (HAS player FK)

PlayerCard

PlayerRelic

PlayerLabProgress

Unlocks

Inventory

C. Derived / Cached Results (HAS player FK)

BattleReport

SimulationRun

AggregatedStats

You can safely delete category C anytime.

***** Data Migration & Onboarding Flow

You’ll need a clean onboarding path:

User creates account

Auto-create Player via signal

Assign default group player

Initialize baseline progress rows

@receiver(post_save, sender=User)
def create_player(sender, instance, created, **kwargs):
    if created:
        Player.objects.create(user=instance)
**** TODO [#C] Export / Share (Lightweight)

- CSV export of derived metrics
- PNG export of charts

This dramatically increases perceived value with very little backend work.
** Backlog [0/3]
“Out of Scope”:
- Cloud sync
- Real-time scraping
  
*** TODO [#A] Efficiency Metrics
Examples:
- Stones per % improvement
- Stones per second saved
- Relative efficiency compared to other UWs

This is powerful, but it opens balance and interpretation questions. Best added once the core dashboards are stable.
*** TODO [#B] What to do with Units Class

We planned it out but have yet to implement it

*** TODO [#C] Required Doc Type Header (Must Prepend to All Docs)
Every document authored or modified by Codex must begin with exactly one of the following headers, placed at the very top of the file.

#+BEGIN_SRC html
User Guide Document
<!--
DOC TYPE: User Guide
AUDIENCE: Players / Non-technical users
PURPOSE: Explain how to use the feature, not how it is built
TONE: Professional, concise, non-technical
-->

Developer / Progress Document
<!--
DOC TYPE: Developer Documentation
AUDIENCE: Contributors / Maintainers
PURPOSE: Explain internal behavior, architecture, or project status
TONE: Technical, precise, implementation-aware
-->
#+END_SRC

**Enforcement Rules**
- Exactly one Doc Type Header is allowed per document
- The header must appear before any headings or content
- The selected doc type determines:
  - Tone
  - Structure
  - Allowed level of technical detail
- If the document content conflicts with the declared Doc Type, the document is considered invalid and must be rewritten

**Default Behavior**

If Codex is unsure which header to use:

- Default to User Guide
- Exclude internal details
- Favor task-based explanations
**** Checklist
Doc Type Validation
- [ ] A Doc Type Header is present at the very top of the document
- [ ] Exactly one Doc Type Header is used
- [ ] The content matches the declared Doc Type

User Guide Documents (if applicable)
- [ ] Written for non-technical users
- [ ] No internal model, class, or file names mentioned
- [ ] No code blocks or CLI instructions
- [ ] Uses clear, action-oriented language
- [ ]  Explains how to use the feature, not how it works internally

Structure & Readability
- [ ] Uses consistent hierarchical headings (H1 → H4 only)
- [ ] Headings alone form a usable Table of Contents
- [ ] Follows task flow where applicable:
  - Overview
  - When to Use This
  - How to Use
  - How to Read the Results
  - Notes & Limitations
- [ ] Steps are short and limited to one action each

Tone & Formatting
- [ ] Professional and concise
- [ ] No slang or casual phrasing
- [ ] Notes and cautions are clearly called out using blockquotes
- [ ] Avoids unnecessary technical detail

Final Sanity Check
- [ ] A new user could follow this document without external explanation
- [ ] The document reads as instructions, not a design or implementation spec
