theTower_stats_app.org
**** Reminder Prompt
Before writing any documentation, select and prepend the appropriate Doc Type Header.
Follow the documentation standards defined in agents.md.
If writing a User Guide, prioritize clarity for non-technical users, avoid internal details, and follow the required task-based structure.
Validate the final document against the Documentation Self-Check Checklist before completing the task.

*** Complete
**** DONE [#A] Fix pytest warnings
CLOSED: [2025-12-16 Tue 11:01]
- State "DONE"       from "TODO"       [2025-12-16 Tue 11:01]
definitions/models.py:279
  /Users/mrmax/projects/theTowerStats/definitions/models.py:279: RemovedInDjango60Warning: CheckConstraint.check is deprecated in favor of `.condition`.
    models.CheckConstraint(

definitions/models.py:343
  /Users/mrmax/projects/theTowerStats/definitions/models.py:343: RemovedInDjango60Warning: CheckConstraint.check is deprecated in favor of `.condition`.
    models.CheckConstraint(

definitions/models.py:407
  /Users/mrmax/projects/theTowerStats/definitions/models.py:407: RemovedInDjango60Warning: CheckConstraint.check is deprecated in favor of `.condition`.
    models.CheckConstraint(

-- Docs: https://docs.pytest.org/en/stable/how-to/capture-warnings.html
**** DONE [#C] Linking Presets/UW/Guardian Chips/Bots to battle history
CLOSED: [2025-12-17 Wed 14:31]
- State "DONE"       from "TODO"       [2025-12-17 Wed 14:31]
Mostly a visual tweak, but adds context and history for the player to interpert their performance history. 
** Codex Tasks
- [X] prompt 16
- [X] prompt 17
- [X] prompt 18
- [X] prompt 19 cards improvements
- [X] prompt 20 Battle History ↔ Preset Tagging
- [X] prompt 21 UW Dashboard
- [X] prompt 22 Bots/Guardian Chips Dashboards
- [X] prompt 24 Cards Dashboard Enhancements
- [ ] prompt 23 phase 5 exit criteria validation
